{
  "auto_mapping": {
    "base_model_class": "XLMRobertaModel",
    "parent_library": "transformers.models.xlm_roberta.modeling_xlm_roberta"
  },
  "base_model_name_or_path": "intfloat/multilingual-e5-base",
  "beta1": 0.85,
  "beta2": 0.85,
  "bias": "none",
  "deltaT": 1,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "init_r": 20,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 32,
  "lora_dropout": 0.1,
  "modules_to_save": null,
  "orth_reg_weight": 0.5,
  "peft_type": "ADALORA",
  "r": 8,
  "rank_pattern": null,
  "revision": null,
  "target_modules": [
    "query",
    "value"
  ],
  "target_r": 16,
  "task_type": null,
  "tfinal": 0,
  "tinit": 0,
  "total_step": null
}